{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "<s>": 2,
      "</s>": 3,
      "a": 4,
      "person": 5,
      "walks": 6,
      "forward": 7,
      "raises": 8,
      "both": 9,
      "hands": 10,
      "takes": 11,
      "two": 12,
      "steps": 13,
      "turns": 14,
      "left": 15,
      "right": 16,
      "describe": 17,
      "motion": 18,
      "generate": 19,
      "caption": 20,
      "from": 21,
      "the": 22,
      "given": 23,
      "multi-person": 24,
      "sequence": 25,
      "body": 26,
      "movements": 27,
      "speech": 28,
      "music": 29,
      "dance": 30,
      "future": 31,
      "predict": 32,
      "interpolate": 33,
      "between": 34,
      "segments": 35,
      "Add": 36,
      "to": 37,
      "this": 38,
      "what": 39,
      "is": 40,
      "happening": 41,
      "in": 42,
      "scene": 43,
      "neutral": 44,
      ".": 45,
      ",": 46,
      "1": 47,
      "2": 48,
      "3": 49,
      "<extra_id_0>": 50,
      "<extra_id_1>": 51,
      "<extra_id_2>": 52,
      "<extra_id_3>": 53,
      "<extra_id_4>": 54,
      "<extra_id_5>": 55,
      "<extra_id_6>": 56,
      "<extra_id_7>": 57,
      "<extra_id_8>": 58,
      "<extra_id_9>": 59,
      "<extra_id_10>": 60,
      "<extra_id_11>": 61,
      "<extra_id_12>": 62,
      "<extra_id_13>": 63,
      "<extra_id_14>": 64,
      "<extra_id_15>": 65,
      "<extra_id_16>": 66,
      "<extra_id_17>": 67,
      "<extra_id_18>": 68,
      "<extra_id_19>": 69,
      "<extra_id_20>": 70,
      "<extra_id_21>": 71,
      "<extra_id_22>": 72,
      "<extra_id_23>": 73,
      "<extra_id_24>": 74,
      "<extra_id_25>": 75,
      "<extra_id_26>": 76,
      "<extra_id_27>": 77,
      "<extra_id_28>": 78,
      "<extra_id_29>": 79,
      "<extra_id_30>": 80,
      "<extra_id_31>": 81,
      "tok_0": 82,
      "tok_1": 83,
      "tok_2": 84,
      "tok_3": 85,
      "tok_4": 86,
      "tok_5": 87,
      "tok_6": 88,
      "tok_7": 89,
      "tok_8": 90,
      "tok_9": 91,
      "tok_10": 92,
      "tok_11": 93,
      "tok_12": 94,
      "tok_13": 95,
      "tok_14": 96,
      "tok_15": 97,
      "tok_16": 98,
      "tok_17": 99,
      "tok_18": 100,
      "tok_19": 101,
      "tok_20": 102,
      "tok_21": 103,
      "tok_22": 104,
      "tok_23": 105,
      "tok_24": 106,
      "tok_25": 107,
      "tok_26": 108,
      "tok_27": 109,
      "tok_28": 110,
      "tok_29": 111,
      "tok_30": 112,
      "tok_31": 113,
      "tok_32": 114,
      "tok_33": 115,
      "tok_34": 116,
      "tok_35": 117,
      "tok_36": 118,
      "tok_37": 119,
      "tok_38": 120,
      "tok_39": 121,
      "tok_40": 122,
      "tok_41": 123,
      "tok_42": 124,
      "tok_43": 125,
      "tok_44": 126,
      "tok_45": 127,
      "tok_46": 128,
      "tok_47": 129,
      "tok_48": 130,
      "tok_49": 131,
      "tok_50": 132,
      "tok_51": 133,
      "tok_52": 134,
      "tok_53": 135,
      "tok_54": 136,
      "tok_55": 137,
      "tok_56": 138,
      "tok_57": 139,
      "tok_58": 140,
      "tok_59": 141,
      "tok_60": 142,
      "tok_61": 143,
      "tok_62": 144,
      "tok_63": 145,
      "tok_64": 146,
      "tok_65": 147,
      "tok_66": 148,
      "tok_67": 149,
      "tok_68": 150,
      "tok_69": 151,
      "tok_70": 152,
      "tok_71": 153,
      "tok_72": 154,
      "tok_73": 155,
      "tok_74": 156,
      "tok_75": 157,
      "tok_76": 158,
      "tok_77": 159,
      "tok_78": 160,
      "tok_79": 161,
      "tok_80": 162,
      "tok_81": 163,
      "tok_82": 164,
      "tok_83": 165,
      "tok_84": 166,
      "tok_85": 167,
      "tok_86": 168,
      "tok_87": 169,
      "tok_88": 170,
      "tok_89": 171,
      "tok_90": 172,
      "tok_91": 173,
      "tok_92": 174,
      "tok_93": 175,
      "tok_94": 176,
      "tok_95": 177,
      "tok_96": 178,
      "tok_97": 179,
      "tok_98": 180,
      "tok_99": 181,
      "tok_100": 182,
      "tok_101": 183,
      "tok_102": 184,
      "tok_103": 185,
      "tok_104": 186,
      "tok_105": 187,
      "tok_106": 188,
      "tok_107": 189,
      "tok_108": 190,
      "tok_109": 191,
      "tok_110": 192,
      "tok_111": 193,
      "tok_112": 194,
      "tok_113": 195,
      "tok_114": 196,
      "tok_115": 197,
      "tok_116": 198,
      "tok_117": 199,
      "tok_118": 200,
      "tok_119": 201,
      "tok_120": 202,
      "tok_121": 203,
      "tok_122": 204,
      "tok_123": 205,
      "tok_124": 206,
      "tok_125": 207,
      "tok_126": 208,
      "tok_127": 209
    },
    "unk_token": "[UNK]"
  }
}